

# ---------------------------------------------------------#
# Даны два словаря. Объедините словари в один.

# dct1 = {
# 	'a': 1,
# 	'b': 2,
# 	'c': 3
# }

# dct2 = {
# 	'e': 4,
# 	'f': 5
# }

# dct1.update(dct2)
# print(dct1)

# ---------------------------------------------------------#
# Напишите код, чтобы получить следующий результат:

# dct1 = {
# 	'3': 'c',
# 	'4': 'd',
# 	'5': 'e'
# }

# dct2 = {
# 	'1': 'a',
# 	'2': 'b'
# }

# dct2.update(dct1)
# print(dct2)

# ---------------------------------------------------------#
# Объедините словари в один, а затем получите список элементов нового словаря.

# dct1 = {
# 	'a': 1,
# 	'b': 2,
# 	'c': 3
# }

# dct2 = {
# 	'x': 4,
# 	'y': 5,
# 	'z': 6
# }

# result = {**dct1, **dct2}
# print(list(dct1.items()))

# ---------------------------------------------------------#
#Объедините словари в один.

# dct1 = {
# 	'a': 1,
# 	'b': 2,
# 	'c': 3
# }

# dct2 = {
# 	'd': 4,
# 	'e': 5,
# 	'f': 6
# }

# dct3 = {
# 	'j': 7,
# 	'h': 8,
# 	'i': 9,
# }

# d3 = dct1 | dct2 | dct3
# print(d3)
